read_verilog mips.v
proc
synth -auto-top
dfflibmap -liberty lib/osu018_stdcells.lib
abc -D 5000 -liberty lib/osu018_stdcells.lib
stat -liberty lib/osu018_stdcells.lib
write_verilog gate.v
